{
  "format": "layers-model",
  "generatedBy": "keras v3.13.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.13.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "functional",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [
                null,
                200
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer",
              "optional": false,
              "batchInputShape": [
                null,
                200
              ]
            },
            "name": "input_layer",
            "inbound_nodes": [],
            "batchInputShape": [
              null,
              200
            ]
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "input_dim": 20000,
              "output_dim": 64,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": {
                  "seed": null,
                  "minval": -0.05,
                  "maxval": 0.05
                },
                "registered_name": null
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "quantization_config": null
            },
            "name": "embedding_1",
            "inbound_nodes": [
              [
                [
                  "input_layer",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "merge_mode": "concat",
              "layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "forward_lstm_1",
                  "trainable": true,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "zero_output_for_mask": true,
                  "units": 64,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": {
                      "seed": null,
                      "gain": 1.0
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "seed": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    200,
                    64
                  ]
                }
              },
              "backward_layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "backward_lstm_1",
                  "trainable": true,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": true,
                  "stateful": false,
                  "unroll": false,
                  "zero_output_for_mask": true,
                  "units": 64,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": {
                      "seed": null,
                      "gain": 1.0
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "seed": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    200,
                    64
                  ]
                }
              }
            },
            "name": "bidirectional_1",
            "inbound_nodes": [
              [
                [
                  "embedding_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "merge_mode": "concat",
              "layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "forward_lstm_2",
                  "trainable": true,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "zero_output_for_mask": false,
                  "units": 32,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": {
                      "seed": null,
                      "gain": 1.0
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "seed": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    200,
                    128
                  ]
                }
              },
              "backward_layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "backward_lstm_2",
                  "trainable": true,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": true,
                  "stateful": false,
                  "unroll": false,
                  "zero_output_for_mask": false,
                  "units": 32,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": {
                      "seed": null,
                      "gain": 1.0
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "seed": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    200,
                    128
                  ]
                }
              }
            },
            "name": "bidirectional_2",
            "inbound_nodes": [
              [
                [
                  "bidirectional_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "bidirectional_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            },
            "name": "dropout",
            "inbound_nodes": [
              [
                [
                  "dense",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "dense_1",
            "inbound_nodes": [
              [
                [
                  "dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "dense_2",
            "inbound_nodes": [
              [
                [
                  "dense_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "dense_3",
            "inbound_nodes": [
              [
                [
                  "dense_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "score_output",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 3,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "score_output",
            "inbound_nodes": [
              [
                [
                  "dense_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "type_output",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 4,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "type_output",
            "inbound_nodes": [
              [
                [
                  "dense_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_layer",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "score_output",
            0,
            0
          ],
          [
            "type_output",
            0,
            0
          ]
        ]
      }
    },
    "training_config": {
      "loss": {
        "score_output": "sparse_categorical_crossentropy",
        "type_output": "sparse_categorical_crossentropy"
      },
      "loss_weights": {
        "score_output": 20.0,
        "type_output": 60.0
      },
      "metrics": {
        "score_output": [
          "accuracy"
        ],
        "type_output": [
          "accuracy"
        ]
      },
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0010000000474974513,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of2.bin",
        "group1-shard2of2.bin"
      ],
      "weights": [
        {
          "name": "bidirectional_1/forward_lstm_1/lstm_cell/kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_1/lstm_cell/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_1/lstm_cell/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/lstm_cell/kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/lstm_cell/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/lstm_cell/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell/kernel",
          "shape": [
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell/recurrent_kernel",
          "shape": [
            32,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell/kernel",
          "shape": [
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell/recurrent_kernel",
          "shape": [
            32,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            32,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            32,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "embedding_1/embeddings",
          "shape": [
            19969,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "score_output/kernel",
          "shape": [
            32,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "score_output/bias",
          "shape": [
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "type_output/kernel",
          "shape": [
            32,
            4
          ],
          "dtype": "float32"
        },
        {
          "name": "type_output/bias",
          "shape": [
            4
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}