["", "[UNK]", "the", "user", "to", "a", "i", "and", "you", "of", "is", "in", "for", "it", "that", "my", "be", "this", "on", "with", "are", "have", "so", "not", "love", "all", "but", "your", "me", "at", "day", "just", "its", "they", "as", "if", "we", "do", "like", "what", "people", "was", "when", "will", "happy", "im", "from", "about", "get", "amp", "up", "or", "time", "can", "out", "how", "more", "no", "dont", "one", "by", "now", "am", "an", "life", "good", "who", "their", "u", "new", "would", "see", "there", "our", "want", "he", "today", "think", "has", "cant", "\u00e2\u0080\u00a6", "positive", "them", "because", "go", "make", "thankful", "only", "why", "some", "his", "know", "work", "take", "really", "way", "bihday", "need", "us", "going", "than", "her", "being", "even", "got", "had", "fathers", "then", "smile", "very", "should", "much", "been", "were", "well", "right", "first", "never", "too", "great", "here", "fun", "still", "best", "back", "she", "healthy", "world", "any", "off", "feel", "these", "family", "2", "youre", "weekend", "other", "most", "friends", "wait", "summer", "over", "many", "after", "say", "beautiful", "someone", "things", "always", "days", "him", "trump", "music", "friday", "bull", "thats", "week", "also", "morning", "could", "where", "last", "sad", "home", "into", "those", "look", "thing", "live", "find", "something", "everyone", "down", "every", "next", "man", "night", "year", "girl", "tomorrow", "come", "fathersday", "model", "did", "cute", "same", "women", "pay", "money", "makes", "better", "orlando", "sex", "free", "finally", "little", "another", "getting", "ever", "which", "might", "blog", "happiness", "before", "again", "game", "person", "old", "ive", "fuck", "believe", "having", "lot", "sunday", "affirmation", "does", "hope", "thank", "show", "around", "ready", "doesnt", "kids", "help", "years", "nothing", "made", "stop", "looking", "keep", "thanks", "may", "god", "amazing", "follow", "long", "without", "food", "two", "news", "own", "gold", "bad", "1", "city", "whatever", "watch", "\u00f0\u009f\u0098\u0099\u00f0\u009f\u0098\u008e\u00f0\u009f\u0091\u0084\u00f0\u009f\u0091\u0085\u00f0\u009f\u0092\u00a6\u00f0\u009f\u0092\u00a6\u00f0\u009f\u0092\u00a6", "yes", "ur\u00f0\u009f\u0093\u00b1", "use", "4", "dad", "until", "change", "big", "actually", "tonight", "feeling", "give", "end", "real", "isnt", "\u00e2\u0086\u009d", "true", "silver", "school", "didnt", "iam", "black", "sure", "enjoy", "yeah", "while", "place", "hate", "said", "such", "altwaystoheal", "3", "via", "let", "girls", "anything", "pretty", "white", "peace", "selfie", "friend", "point", "few", "mean", "doing", "nice", "guys", "away", "baby", "less", "both", "already", "play", "dog", "lol", "job", "hard", "shit", "care", "forex", "since", "left", "father", "against", "men", "through", "attack", "team", "done", "everything", "though", "reason", "enough", "climb", "making", "thought", "funny", "tell", "blessed", "2016", "try", "awesome", "guy", "bear", "please", "sta", "child", "found", "soon", "hot", "else", "deleted", "far", "put", "coming", "anyone", "kind", "face", "probably", "yet", "woman", "sun", "politics", "fucking", "read", "leave", "excited", "wrong", "each", "country", "maybe", "lost", "america", "strong", "cool", "oh", "saying", "saturday", "mind", "house", "health", "polar", "wish", "yourself", "waiting", "agree", "check", "wont", "ill", "win", "post", "others", "call", "theyre", "travel", "video", "fact", "able", "young", "trying", "forward", "angry", "playing", "must", "hes", "used", "healing", "watching", "open", "instagood", "hair", "stay", "miss", "id", "almost", "theres", "power", "beach", "weeks", "least", "gay", "children", "book", "understand", "run", "full", "different", "single", "high", "wedding", "problem", "myself", "grateful", "body", "gonna", "direct", "moment", "matter", "listen", "boy", "success", "hear", "hea", "times", "proud", "media", "rest", "n", "story", "quote", "government", "cause", "once", "motivation", "looks", "couple", "remember", "guess", "business", "living", "head", "comes", "under", "dominate", "view", "truth", "holiday", "gun", "5", "control", "buy", "state", "gets", "whole", "seems", "d", "talk", "month", "either", "monday", "rather", "says", "needs", "issue", "working", "sometimes", "rip", "kill", "environment", "whats", "hour", "10", "racist", "wow", "social", "season", "porn", "late", "side", "case", "shooting", "bit", "alone", "it\u2019s", "idea", "hell", "don\u2019t", "depression", "song", "seen", "culture", "become", "stuff", "racing", "hours", "together", "libtard", "hit", "history", "part", "lets", "twitter", "order", "bing", "meet", "between", "share", "lovely", "goes", "bong", "sleep", "race", "photooftheday", "mindset", "car", "water", "happen", "cold", "went", "eat", "conference", "ask", "ago", "wouldnt", "words", "sense", "obama", "movie", "instead", "followme", "fashion", "easy", "s", "came", "\u00f0\u009f\u0098\u008a", "sexy", "parents", "mom", "join", "buffalo", "american", "top", "ok", "choice", "public", "line", "kid", "wife", "vote", "talking", "set", "name", "choose", "bed", "themselves", "son", "seeing", "crazy", "\u00e2\u009d\u00a4\u00ef\u00b8\u008f", "word", "early", "question", "means", "human", "dads", "political", "joy", "future", "tweets", "london", "june", "dream", "arent", "safe", "r", "nature", "law", "experience", "learn", "education", "bring", "trip", "tax", "loved", "sorry", "phone", "lose", "happened", "half", "especially", "act", "x", "ur", "tbt", "special", "president", "group", "euro2016", "\u00f0\u009f\u0098\u008d", "system", "small", "past", "move", "during", "tv", "relationship", "police", "perfect", "party", "later", "huge", "break", "age", "poetry", "gorilla", "daughter", "war", "tear", "poor", "level", "imagine", "super", "number", "close", "visit", "simply", "often", "hey", "w", "using", "pa", "omg", "lt3", "fight", "cannot", "taking", "places", "course", "beauty", "society", "quotes", "outside", "inspiration", "exactly", "blue", "style", "saw", "room", "lives", "list", "chance", "months", "100", "simple", "photo", "local", "despite", "dead", "dance", "argument", "thursday", "sick", "laugh", "church", "wanted", "walk", "mother", "marriage", "turn", "simulator", "service", "liberal", "adapt", "seem", "red", "ones", "husband", "fine", "evening", "drink", "company", "situation", "shop", "behind", "ass", "wonderful", "wants", "start", "spend", "source", "simulation", "send", "running", "reality", "low", "gone", "event", "difference", "deal", "7", "till", "office", "community", "action", "usually", "retweet", "quality", "nude", "i\u2019m", "green", "fitness", "common", "called", "6", "worry", "likely", "forget", "cat", "anymore", "uk", "second", "mood", "crime", "class", "sweet", "reading", "literally", "exist", "etc", "comments", "color", "anxiety", "picture", "havent", "design", "coffee", "along", "yay", "usa", "tweet", "treat", "sea", "gym", "flowers", "fans", "thinking", "possible", "heard", "favorite", "due", "date", "brother", "risk", "page", "above", "\u00e2\u0080\u0093", "wear", "tired", "thoughts", "save", "ppl", "fire", "entire", "dinner", "ahead", "wasnt", "smiles", "major", "loving", "gift", "example", "empty", "50", "20", "\u00f0\u009f\u0098\u0082", "useful", "stand", "sister", "series", "religion", "relax", "quite", "killed", "hand", "college", "wednesday", "republican", "reddit", "fall", "value", "tickets", "store", "realize", "price", "middle", "delete", "dark", "celebrate", "absolutely", "youtube", "wonder", "vs", "voice", "three", "task", "support", "present", "national", "married", "clearly", "add", "rock", "racism", "offer", "gender", "garden", "death", "complete", "answer", "within", "toptags", "took", "told", "test", "sound", "reach", "loss", "lifestyle", "animal", "vacation", "training", "sign", "hold", "guns", "damn", "daily", "boys", "allahsoil", "account", "religious", "hardcore", "given", "forever", "expect", "beat", "available", "30", "\u00f0\u009f\u0098\u0094", "tgif", "stupid", "shes", "provide", "official", "none", "meeting", "fly", "allow", "target", "sunshine", "speak", "product", "pick", "market", "light", "information", "however", "final", "evidence", "current", "couldnt", "app", "yesterday", "weight", "sell", "respect", "prayfororlando", "paid", "nearly", "mad", "cover", "adult", "1st", "\u00f0\u009f\u0098\u0081", "term", "science", "mass", "lucky", "freedom", "fear", "fast", "blood", "aww", "area", "youve", "victims", "tuesday", "result", "lgbt", "general", "front", "dogs", "born", "violence", "star", "serious", "lack", "hello", "film", "street", "photography", "nervous", "mine", "latest", "important", "feels", "cut", "campaign", "b", "12", "successful", "role", "purpose", "position", "organizations", "leads", "interest", "happening", "goodmorning", "form", "football", "deletetweets", "decision", "comment", "clear", "card", "yall", "y", "takes", "student", "step", "player", "movement", "gop", "followers", "female", "drive", "depressed", "animals", "whether", "wall", "seriously", "road", "response", "project", "lunch", "giving", "everybody", "based", "suppo", "study", "space", "reasons", "piece", "parent", "natural", "million", "large", "inside", "impoant", "hospital", "games", "force", "families", "facebook", "definitely", "daddy", "cry", "completely", "attention", "amount", "worst", "wanna", "town", "totally", "stage", "shows", "die", "cost", "continue", "birds", "across", "works", "truly", "states", "sjw", "problems", "oil", "na", "minute", "majority", "main", "itself", "flag", "energy", "drug", "create", "behavior", "\u00f0\u009f\u0098\u00a2", "tried", "smiling", "prove", "plan", "jobs", "fan", "decide", "customer", "todays", "south", "rich", "okay", "internet", "interesting", "instagram", "hu", "happens", "grow", "edit", "difficult", "board", "beyond", "americans", "8", "welcome", "type", "staff", "rate", "protect", "pic", "opinion", "needed", "minutes", "everyday", "data", "brexit", "ways", "speech", "similar", "shopping", "several", "pm", "mr", "missing", "message", "medical", "homes", "gave", "finished", "finish", "deep", "confused", "claim", "career", "weird", "update", "survive", "sunny", "sounds", "skin", "size", "recent", "reached", "process", "population", "longer", "doctor", "broken", "bought", "benefit", "autism", "arrived", "won", "stas", "specific", "site", "prayers", "policy", "park", "painting", "issues", "finding", "candidate", "building", "bar", "avoid", "vine", "towards", "sexual", "practice", "personal", "pass", "partner", "goal", "dude", "booked", "bc", "air", "wishing", "vaccines", "teacher", "security", "pray", "lead", "killing", "interview", "hillary", "goals", "election", "cream", "congress", "boss", "bill", "west", "that\u2019s", "male", "key", "hands", "gotta", "field", "cake", "whos", "wake", "staing", "smh", "rain", "photos", "near", "moving", "military", "luck", "leaving", "land", "including", "himself", "haha", "gt", "feelings", "drop", "cultural", "club", "chocolate", "challenge", "build", "begin", "babies", "argue", "youll", "xxx", "unless", "united", "taken", "snapchat", "self", "perhaps", "performance", "per", "pathetic", "option", "nation", "hotel", "florida", "fair", "eyes", "discussion", "certain", "cantwait", "accept", "9", "\u00f0\u009f\u0098\u0098", "yo", "wtf", "shouldnt", "shot", "pain", "nyc", "joke", "growth", "fresh", "disney", "broke", "boyfriend", "\u00f0\u009f\u0098\u0080", "upon", "spring", "return", "research", "raise", "picoftheday", "op", "notice", "memories", "material", "lots", "leadership", "knowledge", "glad", "fit", "figure", "fake", "episode", "dangerous", "cultureofdevelopment", "conce", "bag", "allowed", "\u00e2\u009d\u00a4", "teach", "soul", "radio", "paper", "makeup", "leg", "image", "illegal", "heres", "focus", "flight", "door", "cup", "collection", "bday", "assume", "among", "afternoon", "\u00f0\u009f\u0094\u009d", "\u00f0\u009f\u0092\u0095", "worse", "straight", "somebody", "significant", "score", "record", "mention", "heal", "friendship", "five", "explain", "dear", "consider", "benefits", "2nd", "walking", "throw", "third", "supposed", "sub", "sort", "rights", "note", "nasty", "lover", "ht\u00e2\u0080\u00a6", "hill", "four", "eu", "degree", "crying", "calling", "box", "anniversary", "abuse", "2017", "15", "write", "western", "videos", "trade", "thankyou", "statement", "sing", "shame", "property", "nobody", "member", "manager", "learning", "kitchen", "industry", "impact", "ground", "generation", "enjoying", "dreams", "content", "charge", "century", "beer", "base", "actual", "\u00f0\u009f\u0098\u0084", "vicinity", "schools", "program", "online", "nor", "laws", "international", "honestly", "eye", "economic", "court", "certainly", "average", "according", "you\u2019re", "vast", "trust", "total", "theory", "students", "muslim", "mountains", "moments", "july", "improve", "htt\u00e2\u0080\u00a6", "died", "companies", "catch", "bless", "affirmations", "tragedy", "serve", "remain", "ramadan", "orlandoshooting", "met", "lawyer", "india", "gbp", "former", "easier", "describe", "decided", "changes", "breakfast", "yoga", "wishes", "weve", "wet", "trouble", "republicans", "recently", "questions", "professional", "pool", "officially", "muslims", "murder", "method", "lighttherapy", "fix", "fill", "exciting", "england", "donald", "countries", "coach", "asking", "asked", "although", "administration", "3d", "\u00e2\u0080\u0094", "writer", "tend", "table", "spent", "scene", "russia", "ride", "range", "quickly", "pull", "organization", "loves", "lawofattraction", "la", "knows", "kinda", "heart", "gives", "germany", "fantastic", "easily", "drinks", "dj", "chill", "writing", "wine", "university", "teen", "station", "slut", "shoes", "rape", "love\u00e2\u0080\u00a6", "lonely", "knew", "horny", "france", "folks", "economy", "east", "clean", "civil", "center", "arrive", "workout", "wide", "tragic", "suppoers", "shy", "short", "scared", "previous", "prevent", "plus", "opportunity", "oitnb", "negative", "necessary", "missed", "losing", "leader", "israel", "fund", "fridayfeeling", "financial", "felt", "fat", "disappointed", "debate", "congrats", "computer", "bank", "ball", "article", "ability", "udtapunjab", "tech", "stories", "standard", "sit", "prison", "owner", "obviously", "naughty", "legal", "islam", "involved", "ideas", "horrible", "glass", "festival", "draw", "commercial", "basically", "appear", "anyway", "aint", "tree", "ten", "suffer", "pussy", "network", "mouth", "memory", "kinky", "indeed", "increase", "fucked", "eating", "dumb", "chase", "cats", "busy", "blur", "bitch", "biggest", "apple", "alive", "whose", "whom", "upset", "stomping", "staed", "shake", "rule", "push", "pride", "played", "officer", "normal", "listening", "happier", "google", "fish", "effect", "cases", "budget", "billion", "apply", "\u00f0\u009f\u0098\u0083", "york", "vaccine", "treatment", "thread", "terrorism", "tears", "sunset", "rooster", "reveal", "removed", "popular", "pizza", "paying", "opening", "nbafinals", "manage", "lady", "japan", "identify", "humans", "floor", "expanse", "democrat", "carry", "blonde", "apparently", "actor", "worked", "subject", "started", "sport", "reduce", "receive", "queen", "politicians", "players", "personally", "p", "hungry", "hi", "healthcare", "gorgeous", "foot", "employee", "emotional", "effort", "dick", "development", "deserve", "correct", "concern", "watched", "traditional", "tough", "thus", "stuck", "sky", "six", "shut", "shoot", "seat", "scary", "rules", "physical", "passed", "naked", "movies", "likes", "language", "knowing", "heavy", "foreign", "faith", "environmental", "enter", "drinking", "democratic", "consumer", "congratulations", "character", "books", "ban", "turned", "trial", "tips", "terrorists", "technology", "surprise", "soldier", "sho", "represent", "report", "release", "prepare", "pink", "particular", "modern", "interested", "ice", "h\u00e2\u0080\u00a6", "honest", "hatred", "growing", "fighting", "ex", "events", "defense", "countdown", "c", "bernie", "bathroom", "adventure", "activity", "wild", "vegan", "spos", "songs", "sale", "produce", "pop", "plant", "planning", "pictures", "occur", "nba", "link", "include", "helping", "heabroken", "generally", "follow\u00e2\u0080\u00a6", "customers", "clinton", "click", "choices", "changed", "camp", "asian", "arm", "appreciate", "woh", "website", "weather", "views", "vegas", "various", "terrible", "t", "surprised", "seek", "secret", "require", "putting", "puppy", "perform", "o", "management", "king", "jesus", "higher", "evil", "dress", "double", "album", "admit", "yummy", "ya", "winning", "vaccinated", "terrorist", "telling", "seven", "sent", "senior", "rise", "ripchristina", "recognize", "otherwise", "original", "north", "lie", "known", "investment", "hopefully", "favourite", "fail", "excuse", "develop", "decade", "dancing", "currently", "considered", "china", "chair", "central", "camera", "author", "agency", "\u00f0\u009f\u0098\u00ad", "\u00f0\u009f\u0098\u008e", "window", "train", "toward", "til", "tea", "surface", "responsibility", "punjab", "powerful", "posts", "pics", "moral", "meant", "lay", "launch", "ladies", "involve", "instamood", "hundred", "greatest", "girlfriend", "following", "extremely", "extra", "europe", "ended", "edge", "doubt", "direction", "count", "compare", "blame", "birth", "below", "australia", "august", "40", "yours", "v", "trending", "taxes", "suggest", "strength", "snapshot", "production", "peoples", "onto", "multiple", "maintain", "keeping", "inspirational", "individual", "ignorance", "herself", "flower", "ending", "e", "doesn\u2019t", "disgusting", "discuss", "condition", "calm", "brain", "25", "youth", "womens", "weak", "thousand", "suddenly", "sadly", "round", "respond", "resource", "relationships", "region", "pressure", "potential", "melancholy", "machine", "item", "instalike", "flying", "except", "emotions", "e32016", "diet", "citizen", "chicken", "can\u2019t", "california", "brand", "bet", "14", "\u00e2\u0080\u00a2", "workers", "web", "wearing", "unit", "threat", "tho", "thinks", "television", "strategy", "stock", "skill", "received", "pattern", "orange", "matters", "lying", "lovelife", "lebron", "leakage", "l", "inshot", "hero", "exercise", "everywhere", "enemy", "cell", "celebration", "canada", "breaking", "bike", "analysis", "alcohol", "yard", "vibes", "ticket", "spanking", "spain", "sitting", "showing", "shootings", "pulse", "pro", "private", "press", "posted", "obvious", "nofilter", "mrs", "like4like", "keeps", "institution", "held", "heading", "ff", "f", "english", "drawing", "conservative", "client", "christmas", "buying", "bro", "agent", "affect", "90", "spread", "singing", "section", "results", "quick", "particularly", "participant", "paris", "netflix", "mission", "miami\u00e2\u0080\u00a6", "match", "m", "lord", "liberals", "justice", "judge", "instadaily", "idiot", "holy", "holidays", "graduation", "gif", "employees", "e3", "contract", "celebrating", "cavs", "calls", "blogger", "anti", "agreement", "address", "access", "13", "11", "xx", "willing", "whipped", "voters", "unpaid", "ugh", "russian", "professor", "praying", "newyork", "mostly", "miami", "melancholymusic", "magazine", "ireland", "humor", "heaven", "finger", "federal", "fault", "executive", "effective", "eah", "dory", "didn\u2019t", "conservatives", "changing", "bunch", "balance", "aist", "acting", "accepted", "18", "wisdom", "therefore", "taste", "tampa", "review", "relevant", "released", "relaxing", "profit", "positivity", "older", "members", "marshmallows", "i\u2019ve", "groups", "factor", "establish", "driving", "discover", "destroy", "democrats", "definition", "da", "creative", "clothes", "bullshit", "bride", "blm", "bigger", "background", "anger", "\u00f0\u009f\u0092\u0094", "youd", "waste", "wakeup", "version", "teams", "sucks", "stress", "sold", "sales", "repost", "reflect", "newspaper", "nails", "massive", "lmao", "legend", "journey", "jokes", "hoping", "goodnight", "gaming", "faces", "existence", "euro", "disease", "director", "created", "closer", "citizens", "bus", "begins", "band", "attitude", "apps", "approach", "anywhere", "anime", "analytics", "agreed", "afraid", "advice", "\u00f0\u009f\u0092\u0099", "x200b", "worth", "wind", "texas", "terms", "teens", "studies", "stream", "squad", "scientist", "responsible", "reaction", "possibly", "plans", "period", "peaceful", "opposite", "ness", "milk", "measure", "lyrics", "loveit", "humanity", "feet", "essentialoils", "contain", "claims", "childhood", "brought", "bored", "bjp", "becoming", "ad", "\u00f0\u009f\u0092\u009c", "woke", "voting", "tool", "therapy", "temple", "swimming", "status", "spending", "southern", "shoulder", "shift", "relate", "random", "protest", "points", "ordered", "operation", "mark", "maga", "lower", "letter", "kitty", "isis", "iphone", "insane", "incredibly", "ha", "gratitude", "goodvibes", "gas", "friendly", "forgot", "forced", "filled", "false", "expensive", "expected", "determine", "delicious", "cooking", "clients", "cheers", "caught", "cards", "behappy", "authority", "altright", "24", "16", "winner", "warm", "ugly", "trumps", "track", "touch", "studio", "stopped", "st", "silly", "proof", "pls", "plenty", "nightclub", "mistake", "memes", "looked", "logic", "libertarian", "lazy", "lake", "island", "internship", "idwp", "helps", "hearing", "hasnt", "gotten", "foodporn", "drugs", "dies", "continues", "comedy", "christina", "basis", "barely", "audience", "actions", "tour", "suffering", "stadium", "speaking", "someones", "singer", "selling", "seconds", "propaganda", "nights", "moon", "mobile", "mental", "limited", "lies", "laughter", "indicate", "humpday", "hispanic", "fo", "facts", "em", "eight", "download", "disagree", "cuz", "crap", "counting", "closed", "christian", "capitalism", "calgary", "brilliant", "bright", "bigot", "agenda", "70", "3rd", "\u00f0\u009f\u0098\u0082\u00f0\u009f\u0098\u0082", "vaccinate", "updates", "turns", "title", "the\u00e2\u0080\u00a6", "stronger", "somewhere", "smile\u00e2\u0080\u00a6", "session", "services", "ripchristinagrimmie", "revolution", "rainbow", "pure", "pregnant", "prefer", "positivevibes", "pig", "packing", "neither", "millions", "michael", "mexico", "letting", "inspired", "ignored", "ibiza", "hype", "golf", "gamer", "expert", "excellent", "equal", "edm", "dying", "driver", "colombia", "churches", "chinese", "cancer", "british", "assuming", "announce", "active", "17", "\u00f0\u009f\u0092\u0096", "yrs", "winter", "whenever", "uses", "unhappy", "toilet", "throwing", "throughout", "theyve", "staup", "spot", "sports", "somehow", "sma", "sir", "signed", "sharing", "screen", "roll", "required", "registered", "regardless", "products", "plays", "perfectly", "pc", "passion", "ocean", "mins", "mentioned", "loser", "kiss", "kingdom", "kick", "john", "innocent", "impossible", "igers", "gamedev", "fully", "fab", "exists", "euros", "entirely", "discrimination", "creating", "conversation", "compared", "cock", "chicago", "censorship", "caused", "capital", "beginning", "becomes", "awards", "attempt", "art", "anybody", "\u00f0\u009f\u0098\u0089", "\u00e2\u0098\u00ba\u00ef\u00b8\u008f", "zero", "xoxo", "values", "theyll", "theyd", "theatre", "suicide", "structure", "specifically", "separate", "ridiculous", "realized", "princess", "poland", "organic", "non", "niggas", "neutral", "meditation", "loveislove", "lil", "leaves", "learned", "k", "injured", "info", "ignorant", "heas", "heabreaking", "gain", "fun\u00e2\u0080\u00a6", "equality", "epic", "ends", "dragonflies", "detail", "considering", "code", "cleveland", "classic", "brokers", "bout", "bother", "bliss", "blacks", "beliefs", "battle", "basic", "attorney", "alarm", "\u00e2\u0098\u0080\u00ef\u00b8\u008f", "yum", "wrote", "werent", "troll", "text", "teeth", "tattoo", "slow", "sisters", "sikh", "sides", "shower", "restaurant", "resources", "reasonable", "quoteoftheday", "progress", "podcast", "piano", "pet", "names", "mum", "mens", "magic", "jewish", "isn\u2019t", "internships", "idiots", "highly", "happiest", "grace", "goodbye", "gods", "gig", "fox", "foodie", "flights", "fired", "findingdory", "feminism", "f4f", "expectations", "european", "entrepreneur", "email", "earth", "directly", "details", "depressing", "depends", "decades", "complain", "candidates", "bouncingbaby", "blast", "bird", "bff", "bestie", "bestfriend", "bbc", "astrologer", "assault", "artist", "\u00f0\u009f\u0099\u008c", "yep", "wso", "worker", "whites", "weekends", "warriors", "vandalised", "usgtgtgt", "tag", "stars", "shout", "shooter", "shocked", "shitty", "setting", "route", "rally", "punishment", "possibility", "poem", "pissed", "ootd", "marketing", "life\u00e2\u0080\u00a6", "laughing", "kills", "killer", "jo", "italy", "islamic", "insult", "incredible", "incest", "holding", "hits", "heat", "hang", "handsome", "govt", "goodtimes", "foods", "firm", "factory", "confident", "condemns", "cheer", "chat", "bs", "bloody", "blocked", "bitches", "bigotry", "a\u00e2\u0080\u00a6", "attacks", "amazon", "al", "africa", "afford", "adults", "21", "0", "\u00f0\u009f\u0098\u00a1", "yea", "wales", "violent", "typical", "turning", "treated", "topic", "toddler", "summeime", "suit", "strange", "storm", "solve", "solution", "snow", "snap", "skills", "sentence", "senseless", "row", "rid", "reply", "regret", "ran", "path", "parenting", "numbers", "nigga", "misogyny", "medicine", "logins", "leaders", "l4l", "kneeling", "it\u00e2\u0080\u0099s", "indiedev", "identity", "grimmie", "global", "frustrated", "favor", "fabulous", "drunk", "diy", "deserves", "defending", "cross", "credit", "contact", "competition", "cars", "bye", "burn", "babe", "aside", "arms", "annoyed", "amwriting", "allowing", "\u00f0\u009f\u0098\u009e", "\u00f0\u009f\u0098\u0086", "\u00f0\u009f\u0092\u008b", "\u00e2\u0098\u00ba", "worried", "wins", "wellness", "wed", "weapons", "unfounately", "unbelievable", "trash", "throwback", "thousands", "suppoing", "suck", "stone", "stick", "spiders", "signs", "september", "scenario", "safety", "romance", "returns", "rare", "raised", "pushing", "prostitution", "plz", "perspective", "opinions", "net", "necessarily", "moms", "meal", "mate", "malevote", "lately", "kept", "jews", "japanese", "itll", "intelligence", "independent", "immigration", "highest", "handmade", "greece", "goodday", "g", "fool", "flat", "fellow", "fed", "familytime", "exempt", "essential", "enjoyed", "de", "committed", "cnn", "christinagrimmie", "buddy", "bottle", "bomb", "boat", "belief", "bathrooms", "annoying", "airpo", "adorable", "addiction", "abusive", "200", "\u00f0\u009f\u0098\u009c", "\u00f0\u009f\u0098\u008d\u00f0\u009f\u0098\u008d", "\u00f0\u009f\u0092\u0097", "written", "weightloss", "wage", "voted", "traveling", "there\u2019s", "theme", "tells", "talented", "surely", "standing", "spo", "spirit", "sons", "smaller", "shine", "sending", "search", "scotland", "sat", "salad", "rude", "ring", "repo", "remove", "reminder", "regarding", "ps4", "proven", "primary", "platform", "plane", "performing", "nursery", "neverump", "murdered", "moved", "mindfulness", "league", "leading", "kkk", "kindness", "karen", "jersey", "jail", "i\u2019d", "hugs", "hug", "hrs", "hanging", "grand", "gf", "genuine", "followed", "flagday2016", "fb", "eve", "en", "downtown", "democracy", "demand", "cow", "chick", "cares", "burning", "brings", "aware", "arguing", "alligator", "advantage", "added", "22", "yr", "younger", "workshop", "understanding", "tuned", "tonights", "ton", "tiny", "they\u2019re", "taught", "sushi", "suppose", "staying", "smoke", "shocking", "shi", "sexuality", "scientific", "romantic", "related", "refuse", "recipe", "realise", "quiet", "protesting", "profile", "potus", "poster", "picking", "physically", "persons", "paner", "ny", "noh", "mexican", "materia", "marijuana", "mans", "loa", "lifeisgood", "liar", "le", "jump", "jealous", "james", "insecure", "inlove", "imo", "ignore", "hilarious", "harm", "friyay", "forgotten", "fell", "feliz", "fav", "faster", "famous", "enemies", "duty", "dollars", "doctors", "divorce", "defend", "dc", "david", "dating", "cycling", "criminal", "cox", "costs", "corruption", "context", "constantly", "consent", "confidence", "colors", "charity", "canadian", "brothers", "bridge", "became", "award", "ate", "arguments", "ah", "acceptable", "abt", "abortion", "23", "\u00f0\u009f\u0098\u008d\u00f0\u009f\u0098\u008d\u00f0\u009f\u0098\u008d", "\u00f0\u009f\u0092\u009a", "\u00e2\u0099\u00a1", "whoever", "wednesdaywisdom", "users", "twice", "thailand", "talent", "starting", "slowly", "sleepy", "seashepherd", "san", "rose", "rhymes", "request", "referring", "quit", "puts", "protection", "promise", "prices", "premium", "posting", "policies", "planned", "planet", "pets", "parties", "papa", "paladino", "pack", "nuclear", "noticed", "nfl", "misogynist", "miles", "massage", "manchester", "luv", "korea", "income", "immediately", "idk", "icecream", "hurt", "horror", "homophobic", "hole", "hates", "harder", "guitar", "grandpa", "further", "fraud", "fl", "fitfam", "falling", "exact", "everyones", "eng", "electronic", "edinburgh", "dr", "donate", "desire", "delayed", "decisions", "crisis", "crimes", "couples", "cou", "classes", "cities", "christians", "christ", "choosing", "cheap", "channel", "centre", "built", "btw", "blackandwhite", "bihdaygirl", "bass", "banned", "bae", "badly", "awful", "assholes", "antivaxxers", "antiracism", "amen", "african", "affected", "af", "achieve", "absolute", "95", "\u00f0\u009f\u00a4\u0097", "\u00e2\u0080\u00a6\u00e2\u0080\u00a6", "yellow", "wouldve", "woohoo", "washington", "wa", "universal", "uncomfortable", "tshi", "treats", "trans", "toronto", "thx", "terror", "tcot", "tbh", "sydney", "swim", "stunning", "split", "spin", "smoking", "shepherd", "schedule", "retail", "remedies", "redesign", "raw", "rant", "radical", "queens", "properly", "pox", "plants", "picked", "pair", "nazi", "motivated", "mothers", "morals", "mommy", "min", "metal", "meat", "mainly", "ma", "luxury", "lt", "kicked", "joe", "insults", "index", "ig", "host", "hide", "headed", "haters", "hat", "handle", "hahaha", "gross", "giant", "funday", "fuher", "flip", "feminismmuktbharat", "feminismisterrorism", "feminismiscancer", "fave", "fasting", "eh", "earn", "earlier", "delivery", "damage", "cultures", "corner", "cool\u00e2\u0080\u00a6", "concerned", "concept", "complicated", "clouds", "camping", "brown", "bringing", "breaks", "brave", "boring", "block", "blessings", "bitter", "bestfriends", "basketball", "attractive", "attacked", "animation", "angel", "aicle", "adding", "acts", "aap", "35", "19", "\u00f0\u009f\u0099\u0084", "\u00f0\u009f\u0098\u00ad\u00f0\u009f\u0098\u00ad\u00f0\u009f\u0098\u00ad", "\u00f0\u009f\u0098\u0082\u00f0\u009f\u0098\u0082\u00f0\u009f\u0098\u0082", "\u00f0\u009f\u0092\u009e", "\u00f0\u009f\u008e\u0089", "yup", "wealthy", "visiting", "vintage", "valid", "useless", "upcoming", "tumblr", "talks", "steps", "stated", "speed", "sources", "smiley", "smell", "sleeping", "sight", "shooters", "selfies", "seats", "screaming", "sake", "revenue", "resist", "requires", "remind", "putin", "purchase", "providing", "promote", "presidential", "pregnancy", "phase", "percent", "owners", "overall", "options", "oils", "obsessed", "november", "narrative", "moron", "mix", "mirror", "mini", "meme", "location", "lines", "liked", "lied", "legally", "latepost", "kicks", "horrific", "hockey", "hardly", "h", "governments", "gifts", "german", "funding", "fruit", "focused", "finals", "fascist", "exams", "escape", "emo", "domestic", "desperate", "cruel", "copy", "constitution", "co", "climate", "checked", "bts", "blacklivesmatter", "bite", "beaten", "beard", "bbq", "ashamed", "anal", "amendment", "ali", "aka", "\u00f0\u009f\u0099\u0088", "\u00f0\u009f\u0098\u00ad\u00f0\u009f\u0098\u00ad", "\u00f0\u009f\u0098\u00aa", "\u00f0\u009f\u0098\u0081\u00f0\u009f\u0098\u0081\u00f0\u009f\u0098\u0081", "\u00f0\u009f\u0098\u0081\u00f0\u009f\u0098\u0081", "\u00f0\u009f\u008e\u0082", "zen", "wouldn\u2019t", "worlds", "whilst", "welfare", "wars", "vk", "village", "tune", "tony", "tinder", "superior", "stoked", "starts", "speakers", "shots", "sessions", "repeat", "remains", "recommend", "re", "rates", "raped", "purchased", "punished", "productive", "principles", "pretend", "preorder", "precious", "piss", "packed", "outlets", "obamas", "np", "nowplaying", "nonbinary", "nerd", "nah", "morally", "mondaymotivation", "mistakes", "michelle", "marry", "mama", "mall", "lit", "justify", "iran", "inspire", "increasing", "ie", "hollywood", "he\u2019s", "herbal", "hed", "heck", "harassment", "guilty", "groom", "granted", "grade", "george", "genetic", "gains", "funeral", "experiences", "excitement", "exam", "enteainment", "engaged", "emergency", "emails", "dropped", "drama", "diversity", "distance", "disrespectful", "destiny", "delivered", "delighted", "deciding", "decent", "daughters", "crew", "commit", "comics", "comic", "checks", "charged", "causing", "caturday", "cast", "carl", "bottom", "boom", "blowing", "believes", "asshole", "appreciation", "antisemitism", "anthem", "angels", "and\u00e2\u0080\u00a6", "android", "aggressive", "activities", "accident", "80", "60", "1gabba", "\u00f0\u009f\u0099\u008f", "\u00f0\u009f\u0098\u00b1", "yolo", "xd", "won\u2019t", "wise", "whe", "weddings", "wanting", "waking", "votes", "vip", "victim", "vice", "venue", "vaccinations", "unfortunately", "ufc", "t\u00e2\u0080\u00a6", "trend", "traffic", "tools", "teaching", "tan", "supporters", "subreddit", "straw", "starbucks", "stands", "spider", "socialmedia", "silence", "shameful", "sexism", "sets", "scum", "screwed", "sacrifice", "roles", "reunited", "rainy", "pumped", "prize", "preparing", "potentially", "pleasure", "periscope", "peeps", "passing", "paradise", "pants", "paint", "nominee", "nations", "mylove", "mp", "mountain", "mode", "mile", "mature", "materi", "madrid", "loud", "log", "lip", "lights", "kitten", "kevin", "joytrain", "journalists", "jobsearch", "ios", "indiegamedev", "indian", "impression", "ideal", "hopeful", "helped", "hashtag", "gtgt", "greater", "grail", "glasses", "genocide", "gene", "french", "flu", "fbi", "fam", "extreme", "everytime", "elections", "effo", "effects", "ed", "drops", "doors", "deny", "denial", "dems", "define", "deals", "cousins", "couldn\u2019t", "cookies", "confirmed", "compassion", "colorful", "coldplay", "clue", "clothing", "circumstances", "chosen", "childrens", "chapter", "brighton", "boston", "bogota", "bodies", "bloggers", "bitcoin", "bf", "bath", "barcelona", "bags", "awake", "april", "anxious", "annual", "ally", "aim", "ads", "additional", "actress", "2008", "\u00f0\u009f\u00a4\u0094", "\u00f0\u009f\u0098\u0092", "\u00f0\u009f\u0098\u008a\u00f0\u009f\u0098\u008a\u00f0\u009f\u0098\u008a", "\u00f0\u009f\u0091\u008d", "xbox", "worldwide", "wolves", "wing", "webcam", "waves", "wasted", "waited", "vsco", "victory", "usual", "union", "twitch", "turkey", "trees", "travelling", "talked", "s\u00e2\u0080\u00a6", "sweden", "swear", "sundaymorning", "studying", "steal", "square", "species", "southafrica", "soccer", "situations", "sites", "sis", "showed", "shared", "shape", "sexist", "season4", "scream", "scout", "saving", "saved", "satisfied", "sanders", "sadness", "runs", "roses", "root", "river", "revenge", "regular", "rational", "rage", "pulled", "proper", "profits", "pre", "politician", "poems", "photoshoot", "photographer", "personalised", "pays", "paul", "panic", "pakistan", "overweight", "oppounity", "nowadays", "notmypresident", "nope", "nonsense", "niece", "nephew", "nazis", "nationalbestfriendsday", "mods", "minority", "mess", "meets", "males", "mail", "magical", "loveyou", "liverpool", "lived", "likeforlike", "library", "levels", "lesson", "legislation", "leeds", "led", "las", "kicking", "jim", "italian", "instapic", "inspiring", "illustration", "hump", "huh", "honor", "hire", "heads", "headline", "hateful", "golden", "genuinely", "gap", "fr", "filter", "feed", "fantasy", "fallen", "failed", "eurusd", "episodes", "entry", "engage", "empathy", "embrace", "ego", "egg", "dudes", "dragon", "doplants", "dope", "dm", "district", "discourse", "differently", "destroyed", "designed", "cucumbers", "cuck", "complaining", "cinema", "chose", "cheese", "ceain", "causes", "catholic", "casual", "careful", "ca", "buzzing", "brunch", "boot", "bonus", "binge", "bills", "bestseller", "besides", "berlin", "attending", "attend", "army", "aren\u2019t", "appropriation", "appropriate", "anton", "amp\u00e2\u0080\u00a6", "alternative", "accepting", "\u00f0\u009f\u0098\u00ac", "\u00f0\u009f\u0098\u0095", "\u00f0\u009f\u0098\u008a\u00f0\u009f\u0098\u008a", "\u00f0\u009f\u008c\u00b8", "\u00e3\u0083\u00bb\u00e3\u0083\u00bb\u00e3\u0083\u00bb", "\u00e2\u009c\u00a8", "\u00e2\u0096\u00b6", "zone", "youtuber", "xenophobia", "worship", "wolf", "wives", "wh", "wellbeing", "viral", "veterans", "unwanted", "ultimate", "trailer", "tomorrows", "tokyo", "thin", "testing", "teachers", "tb", "taxpayers", "tall", "suspect", "sundayfunday", "summit", "stocks", "stayed", "stats", "standards", "stadiums", "spiritual", "soundcloud", "souls", "sleeps", "silent", "selfish", "seemed", "scouts", "sauce", "salute", "ruined", "ruin", "roof", "respected", "replace", "relaxed", "relatively", "recovery", "react", "rat", "rapist", "ps", "provides", "proves", "prisons", "presents", "pleased", "playlist", "parts", "oscar", "oppressive", "opened", "officers", "offers", "offering", "odd", "nowhere", "nose", "motivate", "meanwhile", "meaning", "massacre", "managed", "magnettherapy", "legitimate", "larger", "ki", "joking", "jew", "items", "irish", "instacool", "hubby", "hopes", "hook", "hitler", "hawaii", "guarantee", "grass", "graduated", "grab", "gin", "gb", "f\u00e2\u0080\u00a6", "freaking", "fought", "films", "figured", "feelgood", "feedback", "failure", "express", "exhausted", "eventually", "equally", "elected", "eid", "dublin", "dry", "dnc", "disneyland", "discovered", "detoxdiet", "determined", "destruction", "deaths", "dare", "cutest", "curry", "curious", "covered", "corrupt", "cop", "cook", "conspiracy", "consequences", "conclusion", "concerns", "comfo", "coast", "cmv", "cheating", "charging", "challenges", "bubbles", "breeding", "boycott", "bob", "blow", "blind", "believed", "banning", "balls", "backwards", "arrest", "appears", "antonyelchin", "andor", "amsterdam", "alimony", "aid", "advocate", "acne", "6th", "31", "27", "11th", "\u00f0\u009f\u0099\u0083", "\u00f0\u009f\u0098\u00a9", "\u00f0\u009f\u0098\u008f", "\u00f0\u009f\u0098\u008b", "\u00f0\u009f\u0098\u0087", "\u00f0\u009f\u0094\u00a5", "\u00e2\u0099\u00a5", "yoy", "wwe", "wwdc2016", "wo", "wings", "whoop", "whereas", "weddingplanning", "weapon", "wealth", "voter", "viewers", "vehicle", "vanilla", "universe", "uni", "unable", "ty", "tom", "tolerance", "thursdaythoughts", "thru", "thrown", "teambts", "systemic", "swag", "supreme", "suicidal", "streets", "strawberries", "somewhat", "solo", "sohappy", "soft", "sirf", "sigh", "shock", "shell", "shall", "secrets", "scientists", "salaries", "sa", "routine", "rough", "rhetoric", "resign", "remarks", "rejected", "referendum", "raining", "qualified", "puntohost", "promoting", "progressive", "priceless", "presentation", "praise", "pr", "positions", "perceived", "ownership", "outfit", "ourselves", "orlandonightclubshooting", "optimistic", "opens", "of\u00e2\u0080\u00a6", "offensive", "nuts", "noise", "naturally", "murdering", "monkey", "mixed", "miserable", "minorities", "minor", "minds", "merely", "meaningless", "master", "mac", "losers", "loads", "lifes", "lgbtq", "legs", "legit", "leather", "lean", "lasvegas", "knife", "jewelry", "invest", "inferior", "individuals", "included", "immigrants", "images", "idol", "humble", "hrc", "hospitals", "hired", "hated", "hamilton", "goodness", "geek", "gameofthrones", "friends\u00e2\u0080\u00a6", "forces", "folk", "fml", "flash", "fights", "fields", "females", "fascism", "farm", "fairly", "faced", "etsy", "estate", "essentially", "ep", "emiratis", "elses", "effectively", "earrings", "drove", "don\u00e2\u0080\u0099t", "dollar", "disgusted", "disgrace", "differences", "di", "depth", "deeply", "dates", "danger", "criticism", "critical", "cried", "creativity", "creates", "coz", "cousin", "convince", "connection", "confirmation", "condolences", "completed", "circle", "cheat", "catching", "camel", "cafe", "bullying", "buildings", "bugs", "border", "bikini", "bihdays", "believing", "beings", "batman", "baseball", "atheist", "ages", "adam", "911", "4th", "40404", "2014", "\u00f0\u009f\u0098\u008c", "\u00f0\u009f\u008e\u00b6", "\u00e2\u009d\u00a4\u00ef\u00b8\u008f\u00e2\u009d\u00a4\u00ef\u00b8\u008f", "\u00e2\u0098\u00b9\u00ef\u00b8\u008f", "\u00e2\u0080\u0094robe", "zelda", "you\u00e2\u0080\u00a6", "yelchin", "warning", "violation", "vids", "valley", "utterly", "unvaccinated", "unleashyourjoy", "typically", "tupac", "transition", "transformation", "trained", "to\u00e2\u0080\u00a6", "toy", "tons", "thrilled", "theft", "terrified", "technically", "tale", "syria", "symptoms", "swing", "surprises", "superhero", "sunnyday", "sunglasses", "summer2016", "suggested", "stupidity", "spoil", "spectrum", "speaks", "slavery", "skinny", "skies", "sketch", "singapore", "sin", "signing", "shown", "shoutout", "shed", "served", "selflove", "seeks", "sand", "salt", "rolling", "roadtrip", "rn", "reso", "resistance", "reported", "regulation", "refugees", "raging", "racial", "quiz", "putinschoice", "punishing", "psychological", "projects", "profession", "prince", "pretending", "presented", "prepared", "premise", "porait", "pops", "pitch", "phones", "pharrell", "peppa", "pen", "parking", "opposition", "openly", "olds", "ohio", "offended", "obesity", "newyear", "native", "nationalist", "nashville", "mod", "mi", "menu", "mentally", "mentality", "mentalhealth", "melbourne", "mcdonalds", "math", "masterkeyexperience", "mandatory", "loveyourself", "lovers", "lovemylife", "loveisland", "losangeles", "lookin", "lifecoach", "libertarians", "lessons", "leftist", "launched", "largest", "laptop", "kpop", "keshi", "kansas", "jumping", "irrelevant", "irl", "intelligent", "instance", "instagay", "infographic", "infinite", "industrial", "indie", "independence", "increased", "ignoring", "ideology", "hv", "hus", "hr", "homemade", "holds", "highlight", "hiding", "heritage", "headphones", "hating", "habits", "gutted", "guest", "grind", "grey", "grandma", "goodmood", "girl\u00e2\u0080\u00a6", "generations", "gel", "gear", "gbpusd", "gays", "fundraising", "ft", "frustrating", "frm", "follows", "fingers", "feminist", "falls", "fails", "factors", "excit", "excess", "eurgbp", "encourage", "emotion", "edc", "documentary", "diseases", "dis", "dig", "decides", "debt", "dealing", "dat", "cycle", "crowd", "croatia", "crash", "cows", "covering", "coverage", "courage", "council", "corporations", "corporate", "convinced", "conversations", "consistent", "conflict", "condo", "colours", "colour", "closing", "cleaning", "claiming", "checking", "cash", "carrying", "cared", "cap", "candy", "candles", "cancel", "button", "bound", "boricua", "bond", "bombs", "blues", "blaming", "biology", "bio", "bih", "besties", "bees", "bbuk", "bay", "attacking", "atm", "assumption", "aspect", "ashiq", "areas", "apa", "announces", "announcement", "announced", "ancestors", "amarinder", "alot", "allows", "allah", "aliens", "alex", "airlines", "adventures", "advanced", "advance", "addition", "actors", "accurate", "accounts", "abortions", "9th", "5th", "28", "26", "247", "2015", "\u00f0\u009f\u0098\u00a5", "\u00f0\u009f\u0098\u009d", "\u00f0\u009f\u0093\u00b7", "\u00f0\u009f\u008c\u008e", "\u00e2\u009d\u00a4\u00ef\u00b8\u008f\u00e2\u009d\u00a4\u00ef\u00b8\u008f\u00e2\u009d\u00a4\u00ef\u00b8\u008f", "\u00e2\u009c\u008c", "\u00e2\u009c\u0088", "\u00e2\u0099\u00a5venusexchange\u00e2\u0099\u00a5", "\u00e2\u0080\u0094anne", "zoo", "wood", "wondering", "williams", "wetterwarnung", "wetter", "wembley", "weaker", "wasi", "warnung", "walls", "vlog", "vlicobs", "vendor", "vaccination", "uselections2016", "usdcad", "unrelated", "uncle", "ultimately", "truck", "trolling", "trends", "treason", "traitor", "toxic", "throat", "theresistance", "teambts\u00e2\u0080\u00a6", "systems", "suppos", "sugar", "sudden", "subjective", "stephen", "stem", "steak", "starkes", "soo", "solid", "socialism", "smart", "siblings", "shoe", "senses", "selfie\u00e2\u0080\u00a6", "sees", "schwandorfchwandorf", "santa", "safer", "saddest", "rome", "robe", "rent", "relations", "recording", "receiving", "rap", "races", "pub", "proved", "protests", "promises", "prom", "prior", "prints", "previously", "preordered", "preferred", "prayer", "pougal", "polarisation", "pointing", "placed", "picoftheday\u00e2\u0080\u00a6", "personality", "patients", "parliament", "oven", "outdoors", "orientation", "orangeisthenewblack", "opposed", "offered", "objective", "object", "nutrition", "nurses", "notes", "nightout", "nightmare", "nigeria", "newcastle", "neutrality", "necklace", "mylife", "motherfucker", "morality", "mohsin", "mma", "minimum", "mil", "messed", "messages", "mega", "measles", "mc", "matt", "mat", "marathon", "loyal", "loose", "logo", "lmfao", "listened", "lion", "lineup", "letsgo", "leftright", "lee", "launching", "largely", "lame", "labour", "kisses", "ka", "judges", "i\u00e2\u0080\u0099m", "itd", "israeli", "isolated", "islamophobia", "iraq", "iqbal", "insurance", "instahappy", "ink", "injustice", "inequality", "incentive", "immoral", "hows", "horse", "honey", "homeless", "hence", "hathaway", "harmful", "greatness", "grailed", "giveaway", "gewitter", "gator", "garbage", "gang", "game7", "galib", "gained", "fuel", "fuckin", "for\u00e2\u0080\u00a6", "forecasts", "follow4follow", "flies", "fixed", "finishing", "finds", "feelinggood", "faraz", "farage", "family\u00e2\u0080\u00a6", "factsguide", "f1", "extremists", "exposed", "exploring", "explained", "expand", "exchange", "eugenics", "ethics", "equivalent", "engineers", "engineer", "elsewhere", "educationfest", "educate", "ear", "dwd", "dropping", "donaldtrump", "dislike", "disaster", "degrees", "default", "dedicated", "cutting", "cute\u00e2\u0080\u00a6", "cure", "css", "crossed", "correctly", "cops", "cope", "controversy", "contribute", "contracts", "contest", "construction", "con", "complaint", "comingsoon", "collect", "cocktails", "clown", "clock", "chain", "celebrations", "cedm", "carlpaladino", "cardiff", "capable", "caoon", "butt", "businesses", "bread", "bottles", "boricua\u00e2\u0080\u00a6", "blamed", "biological", "bible", "bias", "bee", "bang", "balanced", "babygirl", "awkward", "audusd", "atlanta", "approved", "appointment", "appeal", "anyways", "amounts", "amateur", "alabama", "aists", "acknowledge", "abundance", "90s", "500", "49", "21st", "2018", "14th", "1000", "\u00f0\u009f\u0098\u0098\u00f0\u009f\u0098\u0098", "\u00f0\u009f\u0092\u00aa", "\u00f0\u009f\u0091\u008c", "\u00e2\u009e\u00a1", "wwdc", "worrying", "woot", "wonthey", "witch", "wit", "wisconsin", "whisky", "wheres", "weed", "wee", "wave", "wattpad", "wasn\u2019t", "wash", "wages", "vscocam", "vinyl", "vile", "urdu", "unreal", "unfair", "ukraine", "types", "tweeting", "tweeted", "tries", "trapped", "trails", "traditions", "tradition", "tower", "touches", "tonyawards", "tip", "theater", "tennis", "technical", "taylor", "tattoos", "taller", "tagsforlikes", "surprising", "surgery", "supported", "sunrise", "subway", "subs", "strip", "stranger", "stops", "stopping", "stays", "spoiled", "spanish", "spa", "sooo", "sole", "socialist", "sneak", "smith", "similarly", "significantly", "ship", "shill", "shane", "shairi", "setup", "settle", "semester", "script", "scenes", "saysomething", "saturdays", "sarcasm", "sam", "runner", "rugby", "royal", "roads", "rising", "reviews", "retweeted", "retirement", "represents", "reminds", "remembering", "reflections", "recorded", "recognition", "rarely", "ramadhan", "raising", "purple", "pulseshooting", "psychology", "provided", "protected", "prostitutes", "profiling", "professionals", "producer", "print", "prime", "prevents", "pressuring", "presence", "premiere", "premier", "prayersfororlando", "potter", "pot", "polls", "pokemon", "plain", "pigs", "piggies", "pharmacist", "percentage", "pas", "pages", "pageant", "package", "originally", "on\u00e2\u0080\u00a6", "obese", "oakland", "norm", "newmusic", "neck", "namaste", "musictherapy", "mt", "motto", "mornings", "montreal", "monster", "michigan", "me\u00e2\u0080\u00a6", "mentalillness", "membership", "markets", "manga", "loses", "looki", "logical", "locked", "lock", "lo", "lipstick", "lips", "lions", "linux", "limit", "lift", "liberty", "leak", "knock", "kit", "kinds", "kejriwal", "journalism", "joining", "joined", "jimmy", "ji", "jack", "i\u2019ll", "in\u00e2\u0080\u00a6", "invited", "invite", "intended", "institutions", "influence", "incident", "inc", "impressive", "implies", "immune", "imagination", "iloveyou", "houston", "horses", "hoes", "hiphop", "heroes", "herbalremedies", "harry", "hamas", "guide", "guidance", "guests", "grandmother", "grails", "graduating", "goodlife", "generous", "gardening", "gangs", "furniture", "fuhered", "fucks", "frequently", "frank", "forest", "follower", "financially", "ffs", "fewer", "featured", "familiar", "failing", "explore", "euros2016", "era", "entertainment", "engineering", "employment", "employer", "earned", "dutch", "dragonfly", "dogsofinstagram", "discussed", "discipline", "devil", "developed", "delta", "deliver", "delhi", "delay", "deeper", "daddys", "custom", "crafts", "craft", "crack", "cos", "core", "controversial", "continuous", "conservatism", "connected", "connect", "confirm", "confession", "condoms", "comparing", "combat", "colorado", "coldplaywembley", "cm", "cloudy", "cloud", "closest", "closely", "classroom", "christianity", "chilling", "chest", "chaos", "chances", "ceremony", "caring", "cage", "bubble", "brunette", "brainwashed", "boost", "bonding", "bombing", "bestoftheday", "beside", "belgium", "beers", "beating", "beast", "bastards", 